Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At that moment, Venerable Śāriputra asked the Blessed One,

source: བཅོམ་ལྡན་འདས་དགའ་བར་བགྱིད་པ། མགུ་བར་བགྱིད་པའི་མཚན་མ་རྒྱ་ཆེན་པོ་འདི་ལྟ་བུ་འདི་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པར་གྱུར་པ་གདའ་བ་འདི་སུའི་སྔ་ལྟས་ལགས།
en: “Blessed One, whose coming is augured by these delightful and pleasurable signs that manifest on such a vast scale and adorn this great trichiliocosm so richly?”

source: ཤཱ་རིའི་བུ་འདི་ནི་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་རི་སྤོས་ཀྱི་ངད་ལྡང་ནས་འཁོར་མིའམ་ཅི་སྟོང་ཕྲག་དུ་མ་དང་འཁོར་དྲི་ཟ་སྟོང་ཕྲག་དུ་མ་དང་། འཁོར་ལྷ་སྟོང་ཕྲག་དུ་མ་དང་བཅས་ཏེ་འོང་བ་དེའི་སྔ་ལྟས་སོ། །
en: “Śāriputra,” “these are the signs of the arrival of Druma, the king of the kiṃnaras. He is coming from Mount Gandhamādana with a retinue of many thousands of kiṃnaras, a retinue of many thousands of gandharvas, and a retinue of many thousands of gods.”

source: དེ་སྐད་གསུངས་མ་ཐག་ཏུ་དེ་ནས་སྐད་ཅིག་དེ་ལ་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་སིལ་སྙན་དང་། གླུ་དབྱངས་ལེན་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། འཁོར་བརྒྱ་སྟོང་དུ་མས་བསྐོར་ནས་སྟེང་གི་བར་སྣང་ལ་མེ་ཏོག་གི་ཆུ་བོའི་ཆར་འབེབས་ཤིང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་འོངས་ཏེ་
en: As soon as the Blessed One had said those words, the kiṃnara king Druma arrived at the place where the Blessed One was residing. He was accompanied by eighty-four thousand musicians and singers and surrounded by a retinue of several hundred thousand. From the sky above a stream of flowers rained down.

source: ཕྱིན་ནས་འཁོར་དང་བཅས་པས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ཏེབཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: When he arrived, he prostrated with his retinue at the feet of the Blessed One, circumambulated him three times, and sat in front of him.

source: !དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་བདག་ཉིད་ཀྱིས་པི་བང་གི་ཁོག་པ་(བཻདཱུརྱ་,བཻ་ཌཱུརྱ་)ལས་བྱས་པ། འཛམ་བུའི་གླིང་གི་གསེར་གྱི་སབ་ལེའུ་ཅན། ས་ལེ་སྦྲམ་དང་། ནོར་བུ་དང་། རིན་པོ་ཆེ་དུ་མས་སྤྲས་པ། སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ཡོངས་སུ་སྦྱངས་པ་བླངས་ཏེསིལ་སྙན་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་གྲག་པར་བྱེད་དོ། །
en: In the presence of the Blessed One and accompanied by the eighty-four thousand musicians, the kiṃnara king Druma then began to play his lute. Its body was made of beryl and it had trim and veneer made of gold from the Jambū River. It was adorned with gold, jewels, and many precious substances, and purified through the ripening of his previous actions.

source: མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་པི་བང་དེ་བླངས་མ་ཐག་ཏུ་དེ་ནས་པི་བང་གི་སྒྲ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དབྱངས་ཀྱིས་གོ་བར་གྱུར་ཏོ། །
en: As soon as the kiṃnara king Druma started to play, the tunes of his lute resounded throughout this great trichiliocosm.

source: པི་བང་གི་སྒྲ་དེས་འདོད་པ་ན་སྤྱོད་པའི་རྒྱུད་ཀྱི་སྒྲ་དང་། གླུའི་སྒྲ་དང་། ལྷའི་གླུ་དབྱངས་ཀྱི་སྒྲ་རྣམས་ཟིལ་གྱིས་མནན་ཏེ་མི་གསལ་བར་གྱུར་ཏོ། །
en: The tunes from his lute outclassed all the divine music from the strings and songs of the gods of the desire realm, to the point that these could no longer be heard.

source: དེ་ནས་པི་བང་གི་སྒྲ་བསྐུལ་བས་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་གིས། ལྷའི་རོལ་མོ་བོར་ཏེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལྷགས་སོ། །
en: Then, impelled by the tunes of that lute, the gods of the desire realm put down their divine instruments and came to the place where the Blessed One was residing.

source: མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་པི་བང་དེ་བླངས་མ་ཐག་ཏུ་དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་ཤིང་དང་། རིའི་རྒྱལ་པོ་རི་རབ་དང་། གངས་ཅན་དང་། སྤོས་ཀྱི་ངད་ལྡང་དང་། བཏང་བཟུང་དང་། བཏང་བཟུང་ཆེན་པོ་དང་། དེ་མ་ཡིན་པ་གཞན་རི་ནག་པོ་རྣམས་དང་། རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ལྡེག །རབ་ཏུ་ལྡེག །ཀུན་ཏུ་རབ་ཏུ་ལྡེག་གོ། །
en: As soon as the kiṃnara king Druma started to play his lute, all the trees, and the majestic mountains Sumeru, Himavat, Gandhamādana, Mucilinda, and Mahāmucilinda, the black mountains, and all blades of grass, branches, medicinal plants, and forests of this great trichiliososm started to vibrate, shudder, and reel;

source: གཡོ་རབ་ཏུ་གཡོ། ཀུན་ཏུ་རབ་ཏུ་གཡོའོ། །
en: wobble, rock, and sway;

source: འགུལ་རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ་ལོ། །
en: and quiver, tremble, and quake.

source: འདི་ལྟ་སྟེ་དཔེར་ན་ཆང་གིས་ར་རོ་བའི་མི་འཁྱར། རབ་ཏུ་འཁྱར། ཀུན་ཏུ་རབ་ཏུ་འཁྱར་བ་དེ་བཞིན་དུ་ཤིང་དེ་དག་ཐམས་ཅད་དང་། རི་ཐམས་ཅད་ཀྱང་འདུད་རབ་ཏུ་འདུད། ཀུན་ཏུ་རབ་ཏུ་འདུད་དོ།། །།
en: Just as someone intoxicated by liquor staggers, reels, and wobbles, all those trees and mountains started to bend, bow, and twist.

source: མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་པི་བང་ཁོག་པ་(བཻདཱུརྱ་,བཻ་ཌཱུརྱ་)ལས་བྱས་པ་བླངས་མ་ཐག་ཏུ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དེར་འདུས་པའི་ནང་ནས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་མ་གཏོགས་པར་འདོད་ཆགས་དང་བྲལ་བའི་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། མི་དང་། མི་མ་ཡིན་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པའི་དགྲ་བཅོམ་པ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱིས་པི་བང་གི་སྒྲ་དེ་ཐོས་པ་དང་། པི་བང་གི་སྒྲ་དེ་མ་བཟོད་ནས་
en: With the exception of the bodhisattvas who had reached the level of irreversibility, as soon as the kiṃnara king Druma started to play his beryl lute, all those who had gathered in the assembly surrounding the Blessed One—the dispassionate monks, nuns, male lay practitioners, and female lay practitioners, as well as the gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kiṃnaras, and mahoragas, Śakra, Brahmā, the protectors of the world, humans, nonhumans, worthy ones absorbed in the eight liberations, and the entire retinue—became overwhelmed upon hearing the tunes emitted by that lute.

source: རང་རང་གི་སྟན་ལས་ལངས་ཏེ་འདར། རབ་ཏུ་འདར་ཀུན་ཏུ་རབ་ཏུ་འདར་རོ། །
en: They stood up and started to shake, shiver, and tremble;

source: འདུད་རབ་ཏུ་འདུད། ཀུན་དུ་རབ་ཏུ་འདུད་དོ། །
en: they bent, bowed, and twisted;

source: གར་བྱེད་རབ་ཏུ་གར་བྱེད། ཀུན་དུ་རབ་ཏུ་གར་བྱེད་དོ། །
en: and they danced, swayed, and whirled.

source: ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་རང་རང་གི་སྟན་ལ་མི་དགའ་སྟེ།
en: Even all the great hearers could not remain in their seats.

source: འགུལ། རབ་ཏུ་འགུལ་ཞིང་སྤྱོད་ལམ་ཡང་འཁྲུགས་ནས་བྱིས་པ་ཆུང་ངུ་བཞིན་དུ་གར་བྱེད་པ་ལྟ་བུར་སྟོན་ཏོ། །
en: They trembled, shook, acted wildly, and danced around like small children.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་གྱིས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The bodhisattva Divyamauli said to all those great hearers,

source: ཚེ་དང་ལྡན་པ་ཉན་ཐོས་ཆེན་པོ་དག་ཉོན་མོངས་པ་དང་བྲལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ་བདེན་པ་བཞི་མཐོང་བར་གྱུར་པ་ཡིན་ན།
en: “Venerable ones, great hearers, you are free from afflictions, you are absorbed in the eight liberations, and you have seen the four truths.

source: ཅིའི་ཕྱིར་རང་གི་ལུས་འཇོག་པར་མི་ནུས་ཤིང་། ཚེ་དང་ལྡན་པ་དག་བྱིས་པ་ཆུང་ངུ་བཞིན་དུ་གར་བྱེད་པ་ལྟ་བུར་སྟོན།
en: Why can you no longer control your bodies? Venerable ones, you are dancing around like small children!”

source: ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་སྨྲས་པ། རིགས་ཀྱི་བུ་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་པི་བང་འདི་བླངས་པ་དང་། སིལ་སྙན་དང་། གླུ་དབྱངས་སྦྱར་བས་པི་བང་གི་སྒྲ་དེས་བདག་ཅག་ལ་དབང་མེད་པར་བདག་ཅག་གི་ལུས། རང་རང་གི་སྟན་ལ་འདུག་པར་མི་དགའ་ཞིང་འདར། རབ་ཏུ་འདར། ཀུན་དུ་རབ་ཏུ་འདར་ཏེ།
en: “Noble son,” replied the great hearers, “as the kiṃnara king Druma picked up his lute and started playing it, the music and songs made it impossible for us to remain in our seats; we began to shake, shiver, and tremble, and

source: སེམས་རྣམ་པར་གཞག་པར་ཡང་མ་ནུས་སོ། །
en: we were unable to control our minds.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་གྱིས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The bodhisattva Divyamauli then said to the elder Mahākāśyapa,

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོ་རྒས་གཏུགས་འཁོགས་པ། འདོད་པ་ཉུང་བ་ཆོག་ཤེས་པ། སྦྱངས་པའི་ཡོན་ཏན་འཛིན་པ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་མཆོད་རྟེན་དུ་གྱུར་པ་ཡིན་ན
en: “Venerable Mahākāśyapa, you have reached old age and are frail, you are content and have few desires, you uphold the ascetic practices, and you are the focus of worship for the world with its gods, humans, and demigods.

source: ཅིའི་ཕྱིར་རང་གི་ལུས་འཛིན་པར་མི་ནུས་ཤིང་། གནས་བརྟན་དུ་གྱུར་ཀྱང་བྱིས་པ་ཆུང་ངུ་བཞིན་དུ་གར་བྱེད་པ་ལྟ་བུར་སྟོན།
en: Why can you no longer control your body? You are an elder, but you dance around like a small child!”

source: གནས་བརྟན་འོད་སྲུང་ཆེན་པོས་སྨྲས་པ། རིགས་ཀྱི་བུ་དཔེར་ན་དམུ་རླུང་ཕྱད་པའི་རླུང་ལངས་པ་ན་ཤིང་དང་། ནགས་དང་། རི་ཐམས་ཅད་གང་གིས་བདག་རྣམ་པར་གཞག་པའི་སྟོབས་མེད་མཐུ་མེད་དེ
en: “Noble son,” said the elder Mahākāśyapa, “when a violent wind is blowing during a hurricane, all the plants, forests, and mountains become powerless and weak;

source: དེ་དག་ཐམས་ཅད་མི་འདོད་བཞིན་དུ་གཡོ་རབ་ཏུ་གཡོ། འགུལ་རབ་ཏུ་འགུལ་ལོ། །
en: they cannot remain in place and quiver, tremble, shake, and wobble against their will.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་གང་འདི་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་པི་བང་བླངས་པ་དེའི་སྒྲ་ཐོས་པས་བདག་ཅག་དམུ་རླུང་ཕྱད་པས་རི་ཆེན་པོ་བདས་པ་བཞིན་དུ་བདག་འཛིན་མ་ནུས་པར་གྱུར་ཏོ། །
en: Noble son, in the same way, upon hearing the tunes emitted by the lute of the kiṃnara king Druma, we became unable to control ourselves, just like great mountains shaken by a violent hurricane.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྐྱེས་བུ་དམ་པ་འདིའི་སྨོན་ལམ་དང་། བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་ཁྱད་པར་ནི་འདི་འདྲ་སྟེ།
en: Why is that so? Because such are the extraordinary qualities of the aspiration, merit, and wisdom of this sublime being.

source: དེས་ཉན་ཐོས་ཀྱི་བསོད་ནམས་དང་ཡེ་ཤེས་དང་། གཟི་བརྗིད་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་ཏོ། །
en: They outclass the merit, wisdom, and magnificence of the hearers.”

source: བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་གྱིས་སྨྲས་པ།
en: The bodhisattva Divyamauli continued,

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དཔལ་དང་། གཟི་བརྗིད་དང་། སྟོབས་ལ་གང་གི་ཕྱིར་པི་བང་གི་སྒྲ་དེས་བསྐུལ་བའམ། བསྐྱོད་པར་མི་ནུས་པས་བཙུན་པ་འོད་སྲུང་ཆེན་པོ་སུ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་མི་སྐྱེད། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Venerable Mahākāśyapa, the tunes emitted by this lute are unable to affect and shake the splendor, the magnificence, and the power of the bodhisattvas who have reached the level of irreversibility. Therefore, Venerable Mahākāśyapa, why would one not give rise to the mind set on unsurpassed and perfect awakening?

source: གང་ཉི་ཚེའི་ཡེ་ཤེས་དང་ལྡན་པ་རྣམས་ཀྱི་སྟོབས་དང་། གཟི་བརྗིད་དེ་ནི་པི་བང་གི་སྒྲ་འདིས་ཟིལ་གྱིས་ནོན་ཏོ། །གང་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པ་རྣམས་ཀྱི་སྟོབས་དང་། གཟི་བརྗིད་དེ་ལ་ནི་ཟིལ་གྱིས་གནོན་པར་མི་ནུས་པ་ལ་ལྟོས།
en: Notice how the power and magnificence of those who possess limited wisdom is outclassed by the tunes of that lute, and how the power and magnificence of the followers of the Great Vehicle cannot be outclassed.”

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་པི་བང་གི་སྒྲ་དེ་སྒྲོག་པ་ན་སངས་རྒྱས་ཀྱི་མཐུ་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་སྔོན་གྱི་སྨོན་ལམ་གྱི་བྱིན་གྱི་རླབས་ཀྱིས་པི་བང་དེ་དང་སིལ་སྙན་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་ལས་ཚིགས་སུ་བཅད་པ་འདི་དག་བྱུང་ངོ་། །
en: At that moment, when the kiṃnara king Druma played his lute, through the power of the Buddha and the blessings of his previous aspirations, these verses manifested from his lute and the other eighty-four thousand instruments:

source: ཐ་མ་འབྲིང་དང་དེ་བཞིན་མཆོག་རྣམས་ཀྱི། །ཆོས་རྣམས་ཐམས་ཅད་མཉམ་ཞིང་ཆོས་རྣམས་དབེན། །ཞི་བ་སྟོང་པ་མི་འགྱུར་འཁྲུགས་པ་མེད། །གཟོད་ནས་དག་སྟེ་དྲི་མེད་ནམ་མཁའ་བཞིན། །
en: “All inferior, middling, and supreme phenomena Are the same—detached, peaceful, Empty, unchanging, and undisturbed; They are primordially pure, like the stainless sky.

source: གང་དག་ད་ལྟར་གྱི་དང་འདས་པ་ཡི། །སེམས་ཅན་ཀུན་མཉམ་སེམས་ཅན་སེམས་ཅན་མེད། །
en: “All sentient beings of the present and the past Are the same—they are nonbeings.

source: སེམས་ཅན་སྐད་དུ་སྒྲ་རྣམས་འབྱུང་བ་ཡང་། །ཆོས་ཀྱི་སྒྲ་དང་མཚུངས་ཏེ་དེ་ཡང་མེད། །
en: The words of beings expressed in language, too, Are just like Dharma words—they are nonexistent.

source: ཞིང་རྣམས་ཐམས་ཅད་ཞིང་མཉམ་ཞིང་མིན་ཏེ། །བར་སྣང་དང་ནི་མཚུངས་ཤིང་མཉམ་པར་སྣང་། །
en: “All the realms are the same—they are nonrealms Just like space, they manifest as sameness.

source: འཕེལ་བ་མ་ཡིན་མི་ཟད་མ་སྐྱེས་ཏེ། །གསོབ་གསོག་ནམ་མཁའ་ལྟ་བུར་རྣམ་པར་དག །
en: They are beyond increase, inexhaustible, unborn, Empty, and immaculate like space.

source: སངས་རྒྱས་ཀུན་མཉམ་སངས་རྒྱས་སངས་རྒྱས་མིན། །
en: “All buddhas are the same—they are nonbuddhas.

source: ཆོས་དབྱིངས་ངེས་པར་འདྲེས་པ་མེད་པ་སྟེ། །
en: The realm of phenomena is definitely unadulterated;

source: ཚུལ་ཁྲིམས་ཤེས་རབ་ཡེ་ཤེས་རྣམ་གྲོལ་མཉམ། །མཚན་ཉིད་གཅིག་སྟེ་མཚན་མཉམ་མཚན་ཉིད་མེད། །
en: Discipline, insight, wisdom, and liberation are equal, And their single characteristic is sameness—the absence of characteristics.

source: ཉོན་མོངས་ཐམས་ཅད་ཉོན་མོངས་མ་ཡིན་གྲོལ། །
en: “All afflictions are nonafflictions—they are liberated.

source: རྟོག་དང་རྟོག་པ་ཀུན་རྟོག་རྣམ་པར་རྟོག །ནང་ན་རྒྱུ་བ་མ་ཡིན་ཕྱི་རོལ་མིན། །
en: Ideas, thoughts, conceptuality, and discursiveness Move neither internally nor externally, And

source: འདུ་ཤེས་མདུད་པ་ཕྱིན་ཅི་ལོག་ལས་གྱུར། །
en: notions are derived from the knot of mistaken perception.

source: རྣམ་པར་རྟོག་པས་ཆོས་དབྱིངས་མིང་བཏགས་པ། །མིང་དེ་ཉིད་ཀྱང་གཞན་མིན་དེ་བཞིན་མིན། །
en: “The expression realm of phenomena is imputed conceptually, And that expression is beyond sameness and difference.

source: མིང་དང་གཟུགས་ཀྱི་རང་བཞིན་རྗེས་རྟོགས་པ། །དེ་དག་རྟག་ཏུ་མི་ཆགས་འཇིག་རྟེན་སྤྱོད། །
en: Those who have realized the nature of name-and-form Always remain free of attachment when they act within the world.

source: གང་རྣམས་འདས་པའི་བདེ་གཤེགས་གྲངས་མེད་པ། །དེ་དག་གིས་ནི་གང་གསུངས་ཆོས་མང་པོ། །གཟོད་ནས་ཟད་ཅིང་དེངས་དང་འཇིགས་ལས་དབེན། །
en: “The numerous Dharma teachings Taught by the countless blissful ones of the past Are primordially detached from exhaustion, dispersion, and disintegration;

source: དེ་དག་ཡུལ་དང་ཕྱོགས་སུ་འགྲོ་མ་ཡིན། །
en: They do not go anywhere, or in any direction.

source: ཆོས་འདི་དག་ནི་ཡི་གེ་ལས་བྱུང་སྟེ། །
en: “These phenomena originate from words, And

source: ཡི་གེ་གང་དག་ཟད་ཅན་ཟད་པའི་ཆོས། །
en: words are perishable—they have the property of coming to an end.

source: ཡི་གེ་ཟད་པའི་ཆོས་ཉིད་ཤེས་པས་ན། །ཆོས་རྣམས་ཀུན་ལ་རྣམ་པར་རྟོག་མི་བྱེད། །
en: Those who understand the exhaustible nature of words Do not generate concepts about any phenomena.

source: སེམས་ཀྱི་རྒྱུད་ནི་རྒྱུད་མཉམ་རྒྱུད་མ་ཡིན། །རང་བཞིན་གཞན་དང་གཞན་ཏེ་ཆགས་པ་མེད། །
en: “All mindstreams are the same—they are nonmindstreams, Since they are not attached to various natures.

source: སེམས་དང་སེམས་བྱུང་ཆོས་མཐའ་མེད་ཤེས་པས། །འཕགས་པ་རྣམས་ནི་མཉམ་པའི་ཆོས་ལ་འཇུག །
en: Since they know the endless phenomena of mind and mental states, The noble ones understand the sameness of phenomena.

source: མཐའ་དང་མཐའ་མེད་ཀུན་ཆད་རྣམ་པར་ཆད། །
en: “Everything finite and infinite is interrupted and eliminated, And

source: ཐོག་མ་ཐ་མ་བར་མ་མཉམ་གྱུར་པ། །
en: beginning, end, and middle are the same.

source: དུས་གསུམ་དག་ནི་དབེན་པས་ཤེས་པ་མཉམ། །ཤེས་པ་དེ་ཡང་མཐའ་ཡོད་མ་ཡིན་ནོ། །
en: Their knowledge is of sameness since it is detached from the three times, And that knowledge is beyond limits.

source: སྐྱེ་བོ་རྟག་ཏུ་མིང་དང་གཟུགས་ལ་ཆགས། །མཐའ་དང་མཐའ་མེད་ལྟ་བས་གོས་པ་རྣམས། །རྒྱུ་དང་རྐྱེན་ལས་བྱུང་བར་ཤེས་པས་ན། །བདག་དང་སེམས་ཅན་རྣམ་པར་རྟོག་མ་ཡིན། །
en: “Beings are constantly attached to name-and-form And tainted by the views of what is finite and infinite. Those who understand that they originate from causes and conditions Do not conceptualize them in terms of self and other.

source: བདག་ལས་ལྡང་བ་རྟག་ཏུ་ལྡང་མ་ཡིན། །
en: “That which arises from the self is always nonarisen, And

source: ཆོས་དེ་ཀུན་ནས་བསླང་བ་མེད་པ་སྟེ། །
en: all phenomena are beyond emergence.

source: གང་དག་ལྡང་དང་ལྡང་བ་མེད་རྟོག་པ། །དེ་དག་བཟོད་པ་མཉམ་ཉིད་རྗེས་འཐུན་པ། །
en: Those who understand what arises and what is beyond arising Have reached acceptance and are in harmony with sameness.

source: ཆོས་ཀུན་རྟག་ཏུ་བདག་མེད་རང་བཞིན་ཏེ། །སྤྲིན་དང་གློག་དང་ནམ་མཁའ་ལྟ་བུ་གསོག །
en: “All phenomena always have the nature of selflessness— They are empty like clouds, lightning, and space.

source: བདག་དང་སེམས་ཅན་རྟག་ཏུ་རང་བཞིན་སྟོང་། །
en: Oneself and other beings are always intrinsically empty;

source: འདི་ནི་གཟུངས་ཀྱི་ཕྱག་རྒྱར་འཇུག་པའོ། །
en: This is the entrance into the seal of dhāraṇī.

source: ཆོས་རྣམས་མཚན་ཉིད་གཅིག་སྟེ་མཚན་ཉིད་མེད། །
en: “The single characteristic of phenomena is to be devoid of characteristics.

source: གང་གིས་ཐར་པའི་སྒོ་གསུམ་རྣམ་རྟོགས་ནས། །ཐུག་པ་མེད་པའི་ཆོས་རྣམས་སྟོན་བྱེད་ཀྱང་། །ཆོས་ལ་ཡོངས་སུ་རྟོག་པ་མི་བྱེད་དོ། །
en: Those who teach infinite Dharma teachings After having realized the three gateways to liberation Do not conceptualize the Dharma in any way.

source: ཐ་མ་འབྲིང་དང་དེ་བཞིན་མཆོག་རྣམས་ཀྱི། །ཆོས་འདི་དག་ནི་ཡི་གེ་ལས་བྱུང་སྟེ། །
en: “Inferior, middling, and supreme Dharma teachings Originate from words, But

source: ཡི་གེ་རྣམས་ལ་རྣམ་པར་རྟོག་མི་བྱེད། །དེ་ལྟ་བུར་ནི་དོན་རྣམས་བཤད་པ་ཡིན། །
en: they explain their meanings Without conceiving of any words.

source: དོན་དང་ཚིག་འབྲུ་གཉིས་ལ་མི་འཇུག་སྟེ། །
en: “They do not engage in a duality of meaning and words—

source: གཉིས་མེད་རྟག་ཏུ་དོན་ནི་སྒྲ་དང་བྲལ། །
en: The meaning of nonduality is always beyond words.

source: གང་གིས་མཐའ་འདི་དབེན་པར་ཤེས་པ་ནི། །དེ་ཡི་སྔོན་གྱི་མཐའ་ནི་ཉེ་བར་ཆད། །
en: Those who understand that this limit is void Will eliminate its very beginning.

source: གང་དག་སྔོན་མཐའ་ཉེ་བར་ཆད་པ་རྣམས། །འགྲོ་བའི་དོན་དུ་འདུས་བྱས་རྣམས་ལ་སྤྱོད། །
en: “Those who eliminate the very beginning Engage with conditioned things for the sake of beings.

source: ཡང་དག་མཐའ་ནི་རྟག་ཏུ་མཐའ་མེད་ཤེས། །
en: Understanding that the limit of reality is always limitless,

source: དེ་ཡི་བྱམས་དང་སྙིང་རྗེ་ཤིན་ཏུ་དག །
en: Their love and compassion are immaculate.

source: གང་གི་བྱམས་དང་སྙིང་རྗེ་རྣམ་དག་པ། །སྡུག་བསྔལ་དང་ནི་བདེ་བ་མཚུངས་མཉམ་སྦྱོར། །
en: “Those whose love and compassion are immaculate Experience the sameness of suffering and happiness.

source: རྒོད་དང་ཁེངས་པ་མ་ཡིན་བརྟན་པ་ཡི། །སྐྱེས་བུ་མཆོག་དེ་དོན་གྱི་ཆོ་ག་ཤེས། །
en: Not excited, not puffed up, and steadfast, Those supreme beings understand the ultimate conduct.

source: ཆོས་ཀྱི་ཚུལ་འདི་ཞི་ཞིང་དབེན་པ་སྟེ། །
en: “This Dharma way is peaceful and detached.

source: འཆང་བ་ན་ནི་དགའ་བ་འཐོབ་པར་འགྱུར། །
en: When it is explained, it generates joy, Yet

source: ནམ་ཡང་འཕེལ་བ་མེད་ཅིང་འབྲི་བ་མེད། །
en: it is never increasing or decreasing.

source: ཆོས་ཉིད་འདི་ནི་ངར་འཛིན་མེད་ཅིང་ཞི། །
en: Its true reality is beyond self-grasping—it is peace.

source: བར་སྣང་ལམ་གྱི་སྒྲ་ནི་གཟུང་མེད་དེ། །
en: “The words here in the sky are beyond apprehension—

source: གང་གིས་བཤད་པ་མེད་ཀྱང་གྲགས་པར་གྱུར། །
en: No one speaks them but still they are heard.

source: གང་གིས་བཤད་དང་གང་ལ་བཤད་པ་རྣམས། །དེ་དག་ཐམས་ཅད་དབང་ཅན་བརྫུན་པ་ཡིན། །
en: The one who speaks and the ones who are spoken to— What potent fictions they all are!”

source: ཚིགས་སུ་བཅད་པ་མངོན་པར་བསྒྲུབ་པ་འདི་བཤད་པ་ན།
en: As these verses were manifested,

source: བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: their elucidations caused one hundred thousand bodhisattvas to reach acceptance of the unborn nature of phenomena.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, the bodhisattva Divyamauli asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ཚིགས་སུ་བཅད་པ་འདི་ལྟ་བུ་འདི་དག་ག་ལས་བྱུང་། །
en: “Blessed One, where do these verses come from?”

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ལ་དྲིས་ཤིག་དང་། དེས་དེའི་ལན་གློན་པར་འགྱུར་རོ། །
en: “Noble son,” “Ask the kiṃnara king Druma. He will answer your question.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་གྱིས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The bodhisattva Divyamauli then asked the kiṃnara king Druma,

source: མིའམ་ཅིའི་བདག་པོ་ཚིགས་སུ་བཅད་པ་མངོན་པར་བསྒྲུབ་པ་འདི་དག་ག་ལས་བྱུང་།
en: “Lord of the kiṃnaras, where did these manifested verses appear from?”

source: སྨྲས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་ག་ལས་བྱུང་ངོ་། །
en: The kiṃnara king Druma replied, “They come from where the words pronounced by all beings come from.”

source: མིའམ་ཅིའི་བདག་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་ག་ལས་བྱུང་།
en: “Lord of the kiṃnaras, where do the words pronounced by all beings come from?”

source: རིགས་ཀྱི་བུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་ནི་ནམ་མཁའ་ལས་འབྱུང་ངོ་། །
en: “Noble son, the words pronounced by all beings come from space.”

source: མིའམ་ཅིའི་བདག་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་ཁོང་པའི་ནང་ནས་མི་འབྱུང་ངམ།
en: “Lord of the kiṃnaras, is it not the case that the words pronounced by all beings come from within themselves?”

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་ལུས་ཀྱི་ནང་གི་ཁོང་ནས་བྱུང་ངམ། འོན་ཏེ་སེམས་ལས་བྱུང་།
en: “Noble son, what do you think? Do the words pronounced by all beings come from within their bodies, or do they come from their minds?”

source: མིའམ་ཅིའི་བདག་པོ་ལུས་ལས་ཀྱང་མ་ཡིན། སེམས་ལས་ཀྱང་མ་ཡིན་ནོ། །
en: “Lord of the kiṃnaras, they come neither from their bodies nor from their minds,

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ལུས་ནི་བེམས་པོ་གཡོ་བ་མེད་པ། བྱེད་པ་མེད་པ་རྩྭ་དང་བོང་བ་དང་རྩིག་པ་དང་། ཤིང་དང་། མིག་ཡོར་ལྟ་བུའོ། །
en: since their bodies are made of inanimate matter that cannot perform actions—like grass, clay, walls, trees, or optical illusions—and since

source: སེམས་ནི་གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ། ཐོགས་པ་མེད་པ། རྣམ་པར་རིག་པ་མེད་པ་སྟེ། སྒྱུ་མ་ལྟ་བུའོ། །
en: their minds are formless, indemonstrable, unimpeded, and imperceptible like illusions.”

source: རིགས་ཀྱི་བུ་ལུས་དང་སེམས་མ་གཏོགས་པར་གཞན་གང་ནས་སྒྲ་འབྱུང་བར་འགྱུར།
en: “Noble son, apart from their bodies and minds, where else could these words come from?”

source: མིའམ་ཅིའི་བདག་པོ་སེམས་ཅན་རྣམས་ཀྱི་སྒྲ་ནི་ཡིད་ལ་བྱེད་པ་ལས་འབྱུང་བར་བཏགས་སོ། །
en: “Lord of the kiṃnaras, it is said that the words of beings come from mental engagement.”

source: གལ་ཏེ་ནམ་མཁའ་མེད་ན་སྒྲ་ག་ལས་འབྱུང་།
en: “If there were no space, where would sounds come from?”

source: མིའམ་ཅིའི་བདག་པོ་ནམ་མཁའ་མ་གཏོགས་པར་གཞན་གང་ནས་སྒྲ་འབྱུང་བར་འགྱུར།
en: “Lord of the kiṃnaras, apart from space, where else could sounds come from?”

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་རྣམ་གྲངས་འདིས་སྒྲ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ནི་ནམ་མཁའ་ལས་འབྱུང་བར་རིག་པར་བྱའོ། །
en: “Noble son, you should understand through what we have said here that all sounds come from space.

source: ནམ་མཁའི་ངོ་བོ་ཉིད་ནི་སྒྲ་སྟེ།
en: The essential nature of space is sound;

source: རྣམ་པར་རིག་མ་ཐག་ཏུ་འགག་གོ། །
en: it ceases as soon as it is perceived, and

source: འགགས་ནས་ནམ་མཁའི་ངོ་བོ་ཉིད་དུ་ཡང་དག་གནས་སོ། །
en: once it ceases, it remains within the essential nature of space.

source: དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའ་དང་མཉམ་ཞེས་བྱ་སྟེ་
en: It is therefore said that all phenomena are the same as space.

source: རྣམ་པར་རིག་པ་མེད་པ་རྣམ་པར་ཤེས་པར་བྱ་བ་མ་ཡིན་མོད་ཀྱི་སྒྲ་དང་སྒྲའི་བརྡས་བརྗོད་དོ། །བརྗོད་པ་དེ་ཡང་ཐ་སྙད་དོ། །
en: Even though they are surely beyond perception and impossible to know, they are expressed through words and verbal expressions, and those expressions are designations.

source: གང་སྒྲས་བརྗོད་པ་འདི་འདྲ་བར་རབ་ཏུ་ཤེས་པ་དེ་ནི་ཆོས་གང་ལ་ཡང་མངོན་པར་མི་ཆགས་སོ། །
en: Those who understand verbal expressions in this way are not attached to anything;

source: གང་མངོན་པར་མི་ཆགས་པ་དེ་ནི་རྣམ་པར་མི་འཕྲོའོ། །
en: those who are not attached do not generate conceptual elaboration;

source: གང་རྣམ་པར་མི་འཕྲོ་བ་དེ་མི་འཁོར་རོ། །
en: those who do not generate conceptual elaboration do not transmigrate;

source: གང་མི་འཁོར་བ་དེ་མི་ཕྱེད་པའོ། །
en: those who do not circle around are unbreakable;

source: གང་མི་ཕྱེད་པ་དེ་མི་སྐྱེའོ། །
en: those who are unbreakable do not take birth;

source: གང་མི་སྐྱེ་བ་དེ་མི་འཇིག་པར་འདོད་དོ། །
en: those who are not born do not perish;

source: གང་མི་འཇིག་པ་དེ་དང་བའོ། །
en: those who do not perish are pure;

source: གང་དང་བ་དེ་དག་པའོ། །
en: those who are pure are immaculate;

source: གང་དག་པ་དེ་དྲི་མ་མེད་པའོ། །
en: those who are immaculate are stainless;

source: གང་དྲི་མ་མེད་པ་དེ་འོད་གསལ་བའོ། །
en: those who are stainless are clear;
